Тимофей решил соединить все компьютеры в своей компании в единую сеть. Для этого он придумал построить минимальное остовное дерево, чтобы эффективнее использовать ресурсы.

Но от начальства пришла новость о том, что выделенный на сеть бюджет оказался очень большим и его срочно надо израсходовать. Поэтому Тимофея теперь интересуют не минимальные, а максимальные остовные деревья.

Он поручил вам найти вес такого максимального остовного дерева в неориентированном графе, который задаёт схему офиса.

Формат ввода
В первой строке дано количество вершин 
n
n и ребер 
m
m графа (
1
≤
n
≤
1000
,
0
≤
m
≤
100000
1≤n≤1000,0≤m≤100000).

В каждой из следующих 
m
m строк заданы рёбра в виде троек чисел 
u
,
v
,
w
u,v,w. 
u
u и 
v
v — вершины, которые соединяет это ребро. 
w
w — его вес ( 
1
≤
u
,
v
≤
n
1≤u,v≤n, 
0
≤
w
≤
10000
0≤w≤10000). В графе могут быть петли и кратные ребра. Граф может оказаться несвязным.

Формат вывода
Если максимальное остовное дерево существует, то выведите его вес. Иначе (если в графе несколько компонент связности) выведите фразу «Oops! I did it again».

Пример 1
Ввод
Вывод
4 4
1 2 5
1 3 6
2 4 8
3 4 3
19
Пример 2
Ввод
Вывод
3 3
1 2 1
1 2 2
2 3 1
3
Пример 3
Ввод
Вывод
2 0
Oops! I did it again
