Вам дан массив натуральных чисел 
a
i
a 
i
​
 . Найдите число таких пар элементов 
(
a
i
,
a
j
)
(a 
i
​
 ,a 
j
​
 ), где 
∣
a
i
−
a
j
∣
%
200
=
=
0
∣a 
i
​
 −a 
j
​
 ∣%200==0 и 
i
<
j
i<j.

Вы можете воспользоваться заготовками кода для данной задачи из репозитория курса.

Формат ввода
В первой строке дан размер массива 
n
n (
1
≤
n
≤
200000
1≤n≤200000 ).

Во второй строке через пробел записаны элементы массива 
a
i
a 
i
​
  (
1
≤
a
i
≤
1
0
9
1≤a 
i
​
 ≤10 
9
 ).

Формат вывода
Выведите единственное число — количество пар, подходящих под указанное выше условие.

Пример 1
Ввод
Вывод
5
203 404 204 200 403
2
Пример 2
Ввод
Вывод
1
1000000
0
Пример 3
Ввод
Вывод
3
2022 2020 2021
0
